export type CategoryNode = {
  id: string;
  name: string;
  children?: CategoryNode[];
};

export const MOCK_CATEGORIES: CategoryNode[] = [
  {
    "id": "1",
    "name": "工业品",
    "children": [
      {
        "id": "1-01",
        "name": "办公耗材",
        "children": [
          {
            "id": "1-01-001",
            "name": "纸类"
          },
          {
            "id": "1-01-002",
            "name": "文具"
          },
          {
            "id": "1-01-003",
            "name": "文件管理"
          }
        ]
      },
      {
        "id": "1-02",
        "name": "办公设备",
        "children": [
          {
            "id": "1-02-001",
            "name": "电脑"
          },
          {
            "id": "1-02-002",
            "name": "网络配件"
          },
          {
            "id": "1-02-003",
            "name": "外接配件"
          }
        ]
      },
      {
        "id": "1-03",
        "name": "安防用品",
        "children": [
          {
            "id": "1-03-001",
            "name": "安全警示"
          },
          {
            "id": "1-03-002",
            "name": "安全器具"
          },
          {
            "id": "1-03-003",
            "name": "化学品处理/存储"
          },
          {
            "id": "1-03-004",
            "name": "监控设备"
          },
          {
            "id": "1-03-005",
            "name": "安检设备"
          },
          {
            "id": "1-03-006",
            "name": "消防器材"
          },
          {
            "id": "1-03-007",
            "name": "应急处理"
          }
        ]
      },
      {
        "id": "1-04",
        "name": "搬运存储",
        "children": [
          {
            "id": "1-04-001",
            "name": "搬运设备"
          },
          {
            "id": "1-04-002",
            "name": "存储设备"
          }
        ]
      },
      {
        "id": "1-05",
        "name": "标签包装",
        "children": [
          {
            "id": "1-05-001",
            "name": "包装工具"
          },
          {
            "id": "1-05-002",
            "name": "包装耗材"
          },
          {
            "id": "1-05-003",
            "name": "标签打印耗材"
          },
          {
            "id": "1-05-004",
            "name": "标签打印设备"
          }
        ]
      },
      {
        "id": "1-06",
        "name": "传感器",
        "children": [
          {
            "id": "1-06-001",
            "name": "测力传感器"
          },
          {
            "id": "1-06-002",
            "name": "电流传感器"
          },
          {
            "id": "1-06-003",
            "name": "电容触摸传感器"
          },
          {
            "id": "1-06-004",
            "name": "光学传感器"
          },
          {
            "id": "1-06-005",
            "name": "环境传感器"
          },
          {
            "id": "1-06-006",
            "name": "近程传感器"
          },
          {
            "id": "1-06-007",
            "name": "生物医学传感器"
          },
          {
            "id": "1-06-008",
            "name": "位移传感器"
          },
          {
            "id": "1-06-009",
            "name": "压力传感器"
          },
          {
            "id": "1-06-010",
            "name": "运动与定位传感器"
          }
        ]
      },
      {
        "id": "1-07",
        "name": "电料辅件",
        "children": [
          {
            "id": "1-07-001",
            "name": "安全工器具"
          },
          {
            "id": "1-07-002",
            "name": "电力金具"
          },
          {
            "id": "1-07-003",
            "name": "其他电料辅件"
          }
        ]
      },
      {
        "id": "1-08",
        "name": "电线电缆",
        "children": [
          {
            "id": "1-08-001",
            "name": "电力电缆"
          },
          {
            "id": "1-08-002",
            "name": "电气装备电缆"
          },
          {
            "id": "1-08-003",
            "name": "裸线类"
          },
          {
            "id": "1-08-004",
            "name": "绕组线类"
          },
          {
            "id": "1-08-005",
            "name": "通信/光缆"
          }
        ]
      },
      {
        "id": "1-09",
        "name": "电子连接器",
        "children": [
          {
            "id": "1-09-001",
            "name": "D-Sub连接器"
          },
          {
            "id": "1-09-002",
            "name": "FFC/FPC连接器"
          },
          {
            "id": "1-09-003",
            "name": "I/O连接器"
          },
          {
            "id": "1-09-004",
            "name": "IC与器件插座"
          },
          {
            "id": "1-09-005",
            "name": "USB连接器"
          },
          {
            "id": "1-09-006",
            "name": "板对板连接器"
          },
          {
            "id": "1-09-007",
            "name": "存储连接器"
          },
          {
            "id": "1-09-008",
            "name": "电源连接器"
          },
          {
            "id": "1-09-009",
            "name": "端子连接器"
          },
          {
            "id": "1-09-010",
            "name": "管脚和插座连接器"
          },
          {
            "id": "1-09-011",
            "name": "光纤连接器"
          },
          {
            "id": "1-09-012",
            "name": "接线端子"
          },
          {
            "id": "1-09-013",
            "name": "接线系统"
          },
          {
            "id": "1-09-014",
            "name": "模块连接器"
          },
          {
            "id": "1-09-015",
            "name": "汽车连接器"
          },
          {
            "id": "1-09-016",
            "name": "射频互连"
          },
          {
            "id": "1-09-017",
            "name": "太阳能/光伏连接器"
          },
          {
            "id": "1-09-018",
            "name": "音视频连接器"
          },
          {
            "id": "1-09-019",
            "name": "圆形连接器"
          },
          {
            "id": "1-09-020",
            "name": "照明连接器"
          }
        ]
      },
      {
        "id": "1-10",
        "name": "动力传输",
        "children": [
          {
            "id": "1-10-001",
            "name": "滑轨及附件"
          },
          {
            "id": "1-10-002",
            "name": "皮带"
          },
          {
            "id": "1-10-003",
            "name": "轴承及附件"
          },
          {
            "id": "1-10-004",
            "name": "自动化零部件"
          }
        ]
      },
      {
        "id": "1-11",
        "name": "动力工具",
        "children": [
          {
            "id": "1-11-001",
            "name": "电动工具"
          },
          {
            "id": "1-11-002",
            "name": "其它动力工具"
          },
          {
            "id": "1-11-003",
            "name": "气动工具"
          },
          {
            "id": "1-11-004",
            "name": "液压工具"
          },
          {
            "id": "1-11-005",
            "name": "燃油工具"
          }
        ]
      },
      {
        "id": "1-12",
        "name": "分立器件",
        "children": [
          {
            "id": "1-12-001",
            "name": "二极管/整流器"
          },
          {
            "id": "1-12-002",
            "name": "功率模块"
          },
          {
            "id": "1-12-003",
            "name": "晶体管"
          },
          {
            "id": "1-12-004",
            "name": "晶闸管"
          }
        ]
      },
      {
        "id": "1-13",
        "name": "个人防护",
        "children": [
          {
            "id": "1-13-001",
            "name": "个人卫生"
          },
          {
            "id": "1-13-002",
            "name": "焊接防护"
          },
          {
            "id": "1-13-003",
            "name": "呼吸防护"
          },
          {
            "id": "1-13-004",
            "name": "静电无尘"
          },
          {
            "id": "1-13-005",
            "name": "手足防护"
          },
          {
            "id": "1-13-006",
            "name": "听力防护"
          },
          {
            "id": "1-13-007",
            "name": "头部防护"
          },
          {
            "id": "1-13-008",
            "name": "坠落防护"
          }
        ]
      },
      {
        "id": "1-14",
        "name": "工具耗材",
        "children": [
          {
            "id": "1-14-001",
            "name": "工具耗材"
          }
        ]
      },
      {
        "id": "1-15",
        "name": "工控自动化",
        "children": [
          {
            "id": "1-15-001",
            "name": "PLC"
          },
          {
            "id": "1-15-002",
            "name": "按钮/指示灯"
          },
          {
            "id": "1-15-003",
            "name": "变频器"
          },
          {
            "id": "1-15-004",
            "name": "发电设备/电机"
          },
          {
            "id": "1-15-005",
            "name": "继电器"
          },
          {
            "id": "1-15-006",
            "name": "接触器"
          }
        ]
      },
      {
        "id": "1-16",
        "name": "公共设施",
        "children": [
          {
            "id": "1-16-001",
            "name": "流体相关"
          },
          {
            "id": "1-16-002",
            "name": "暖通"
          },
          {
            "id": "1-16-003",
            "name": "照明"
          }
        ]
      },
      {
        "id": "1-17",
        "name": "焊接用品",
        "children": [
          {
            "id": "1-17-001",
            "name": "焊接耗材"
          },
          {
            "id": "1-17-002",
            "name": "焊接设备"
          }
        ]
      },
      {
        "id": "1-18",
        "name": "化学品",
        "children": [
          {
            "id": "1-18-001",
            "name": "防锈剂"
          },
          {
            "id": "1-18-002",
            "name": "工业检测试剂"
          },
          {
            "id": "1-18-003",
            "name": "化学试剂"
          },
          {
            "id": "1-18-004",
            "name": "胶粘剂"
          },
          {
            "id": "1-18-005",
            "name": "金属加工液"
          },
          {
            "id": "1-18-006",
            "name": "清洁化学品"
          },
          {
            "id": "1-18-007",
            "name": "润滑剂"
          },
          {
            "id": "1-18-008",
            "name": "脱模剂"
          },
          {
            "id": "1-18-009",
            "name": "油漆涂料"
          }
        ]
      },
      {
        "id": "1-19",
        "name": "机电器件",
        "children": [
          {
            "id": "1-19-001",
            "name": "机电产品包装"
          },
          {
            "id": "1-19-002",
            "name": "PCB电路板"
          },
          {
            "id": "1-19-003",
            "name": "电子开关"
          },
          {
            "id": "1-19-004",
            "name": "开发板"
          },
          {
            "id": "1-19-005",
            "name": "开发工具"
          },
          {
            "id": "1-19-006",
            "name": "屏幕"
          },
          {
            "id": "1-19-007",
            "name": "摄像头"
          },
          {
            "id": "1-19-008",
            "name": "声学器件"
          },
          {
            "id": "1-19-009",
            "name": "外壳组件"
          }
        ]
      },
      {
        "id": "1-20",
        "name": "机械及行业设备",
        "children": [
          {
            "id": "1-20-001",
            "name": "大型设备"
          }
        ]
      },
      {
        "id": "1-21",
        "name": "集成电路",
        "children": [
          {
            "id": "1-21-001",
            "name": "存储器"
          },
          {
            "id": "1-21-002",
            "name": "电源管理芯片"
          },
          {
            "id": "1-21-003",
            "name": "多媒体IC"
          },
          {
            "id": "1-21-004",
            "name": "放大器"
          },
          {
            "id": "1-21-005",
            "name": "光电耦合器"
          },
          {
            "id": "1-21-006",
            "name": "计数器"
          },
          {
            "id": "1-21-007",
            "name": "接口IC"
          },
          {
            "id": "1-21-008",
            "name": "均衡器"
          },
          {
            "id": "1-21-009",
            "name": "开关IC"
          },
          {
            "id": "1-21-010",
            "name": "驱动器"
          },
          {
            "id": "1-21-011",
            "name": "射频IC"
          },
          {
            "id": "1-21-012",
            "name": "时钟IC"
          },
          {
            "id": "1-21-013",
            "name": "芯片组"
          },
          {
            "id": "1-21-014",
            "name": "有源滤波器"
          }
        ]
      },
      {
        "id": "1-22",
        "name": "金属加工",
        "children": [
          {
            "id": "1-22-001",
            "name": "机床"
          },
          {
            "id": "1-22-002",
            "name": "金属加工配件"
          },
          {
            "id": "1-22-003",
            "name": "量具"
          },
          {
            "id": "1-22-004",
            "name": "磨具磨料"
          },
          {
            "id": "1-22-005",
            "name": "刃具"
          }
        ]
      },
      {
        "id": "1-23",
        "name": "紧固密封件",
        "children": [
          {
            "id": "1-23-001",
            "name": "紧固件"
          },
          {
            "id": "1-23-002",
            "name": "密封件"
          }
        ]
      },
      {
        "id": "1-24",
        "name": "晶体与晶振",
        "children": [
          {
            "id": "1-24-001",
            "name": "晶体振荡器"
          }
        ]
      },
      {
        "id": "1-25",
        "name": "联保物资",
        "children": [
          {
            "id": "1-25-001",
            "name": "联保交通"
          },
          {
            "id": "1-25-002",
            "name": "联保器材"
          },
          {
            "id": "1-25-003",
            "name": "联保卫生"
          },
          {
            "id": "1-25-004",
            "name": "联保训练"
          }
        ]
      },
      {
        "id": "1-26",
        "name": "模块电源",
        "children": [
          {
            "id": "1-26-001",
            "name": "AC/DC转换器"
          },
          {
            "id": "1-26-002",
            "name": "AC输入模块"
          },
          {
            "id": "1-26-003",
            "name": "DC/DC转换器"
          },
          {
            "id": "1-26-004",
            "name": "超级电容器"
          },
          {
            "id": "1-26-005",
            "name": "电子电池"
          },
          {
            "id": "1-26-006",
            "name": "功率调节器"
          },
          {
            "id": "1-26-007",
            "name": "功率逆变器"
          }
        ]
      },
      {
        "id": "1-27",
        "name": "起重设备",
        "children": [
          {
            "id": "1-27-001",
            "name": "搬运车"
          },
          {
            "id": "1-27-002",
            "name": "钢丝绳"
          },
          {
            "id": "1-27-003",
            "name": "脚手架"
          },
          {
            "id": "1-27-004",
            "name": "其它起重工具"
          },
          {
            "id": "1-27-005",
            "name": "起重吊钳"
          },
          {
            "id": "1-27-006",
            "name": "起重葫芦"
          },
          {
            "id": "1-27-007",
            "name": "起重滑车"
          },
          {
            "id": "1-27-008",
            "name": "千斤顶"
          },
          {
            "id": "1-27-009",
            "name": "牵引器"
          }
        ]
      },
      {
        "id": "1-28",
        "name": "气动液压",
        "children": [
          {
            "id": "1-28-001",
            "name": "气动元件"
          },
          {
            "id": "1-28-002",
            "name": "液压元件"
          }
        ]
      },
      {
        "id": "1-29",
        "name": "嵌入式处理器",
        "children": [
          {
            "id": "1-29-001",
            "name": "DSP/DSC-数字信号处理器和控制器"
          },
          {
            "id": "1-29-002",
            "name": "MCU-嵌入式微控制器"
          },
          {
            "id": "1-29-003",
            "name": "MPU-嵌入式微处理器"
          }
        ]
      },
      {
        "id": "1-30",
        "name": "清洁用品",
        "children": [
          {
            "id": "1-30-001",
            "name": "地垫/矿棉板"
          },
          {
            "id": "1-30-002",
            "name": "擦拭"
          },
          {
            "id": "1-30-003",
            "name": "垃圾处理"
          },
          {
            "id": "1-30-004",
            "name": "清洁工具及设备"
          },
          {
            "id": "1-30-005",
            "name": "清洗剂"
          },
          {
            "id": "1-30-006",
            "name": "吸附用品"
          },
          {
            "id": "1-30-007",
            "name": "洗手间用品"
          }
        ]
      },
      {
        "id": "1-31",
        "name": "实验室用品",
        "children": [
          {
            "id": "1-31-001",
            "name": "实验室耗材"
          },
          {
            "id": "1-31-002",
            "name": "实验室设备"
          },
          {
            "id": "1-31-003",
            "name": "实验室试剂"
          }
        ]
      },
      {
        "id": "1-32",
        "name": "手动工具",
        "children": [
          {
            "id": "1-32-001",
            "name": "测量工具"
          },
          {
            "id": "1-32-002",
            "name": "绝缘工具"
          },
          {
            "id": "1-32-003",
            "name": "工具存储"
          },
          {
            "id": "1-32-004",
            "name": "工具套装"
          },
          {
            "id": "1-32-005",
            "name": "管道工具"
          },
          {
            "id": "1-32-006",
            "name": "夹持工具"
          },
          {
            "id": "1-32-007",
            "name": "紧固工具"
          },
          {
            "id": "1-32-008",
            "name": "扭力工具"
          },
          {
            "id": "1-32-009",
            "name": "汽修工具"
          },
          {
            "id": "1-32-010",
            "name": "敲击工具"
          },
          {
            "id": "1-32-011",
            "name": "切割工具"
          }
        ]
      },
      {
        "id": "1-33",
        "name": "无线模块与适配器",
        "children": [
          {
            "id": "1-33-001",
            "name": "接口模块"
          },
          {
            "id": "1-33-002",
            "name": "模块附件"
          },
          {
            "id": "1-33-003",
            "name": "射频模块"
          },
          {
            "id": "1-33-004",
            "name": "识别模块"
          }
        ]
      },
      {
        "id": "1-34",
        "name": "无源元件",
        "children": [
          {
            "id": "1-34-001",
            "name": "编码器"
          },
          {
            "id": "1-34-002",
            "name": "电感器"
          },
          {
            "id": "1-34-003",
            "name": "电位器"
          },
          {
            "id": "1-34-004",
            "name": "电子变压器"
          },
          {
            "id": "1-34-005",
            "name": "电子电容"
          },
          {
            "id": "1-34-006",
            "name": "电子天线"
          },
          {
            "id": "1-34-007",
            "name": "电阻器"
          },
          {
            "id": "1-34-008",
            "name": "滤波器"
          },
          {
            "id": "1-34-009",
            "name": "热敏电阻"
          },
          {
            "id": "1-34-010",
            "name": "铁氧体"
          },
          {
            "id": "1-34-011",
            "name": "信号调节器"
          },
          {
            "id": "1-34-012",
            "name": "压敏电阻"
          }
        ]
      },
      {
        "id": "1-35",
        "name": "仪器仪表",
        "children": [
          {
            "id": "1-35-001",
            "name": "电工仪表"
          },
          {
            "id": "1-35-002",
            "name": "分析检测"
          },
          {
            "id": "1-35-003",
            "name": "流量仪表"
          },
          {
            "id": "1-35-004",
            "name": "其它仪表"
          },
          {
            "id": "1-35-005",
            "name": "数显控制"
          },
          {
            "id": "1-35-006",
            "name": "温度仪表"
          },
          {
            "id": "1-35-007",
            "name": "物/液位仪表"
          },
          {
            "id": "1-35-008",
            "name": "压力仪表"
          }
        ]
      },
      {
        "id": "1-36",
        "name": "元器件电路保护",
        "children": [
          {
            "id": "1-36-001",
            "name": "ESD抑制器/TVS二极管"
          },
          {
            "id": "1-36-002",
            "name": "LED保护设备"
          },
          {
            "id": "1-36-003",
            "name": "保险丝"
          },
          {
            "id": "1-36-004",
            "name": "保险丝座"
          },
          {
            "id": "1-36-005",
            "name": "电路保护套件"
          }
        ]
      },
      {
        "id": "1-37",
        "name": "元器件供应链服务",
        "children": [
          {
            "id": "1-37-001",
            "name": "模具制作"
          },
          {
            "id": "1-37-002",
            "name": "元器件代采"
          }
        ]
      },
      {
        "id": "1-38",
        "name": "原材料",
        "children": [
          {
            "id": "1-38-001",
            "name": "化纤原料"
          },
          {
            "id": "1-38-002",
            "name": "石油化工原料"
          },
          {
            "id": "1-38-003",
            "name": "无机化工原料"
          },
          {
            "id": "1-38-004",
            "name": "型材"
          },
          {
            "id": "1-38-005",
            "name": "有机化工原料"
          }
        ]
      },
      {
        "id": "1-39",
        "name": "中低压配电",
        "children": [
          {
            "id": "1-39-001",
            "name": "保护器"
          },
          {
            "id": "1-39-002",
            "name": "变压器"
          },
          {
            "id": "1-39-003",
            "name": "插座"
          },
          {
            "id": "1-39-004",
            "name": "电抗器"
          },
          {
            "id": "1-39-005",
            "name": "电力仪表"
          },
          {
            "id": "1-39-006",
            "name": "电容器"
          },
          {
            "id": "1-39-007",
            "name": "断路器"
          },
          {
            "id": "1-39-008",
            "name": "供电保护"
          },
          {
            "id": "1-39-009",
            "name": "互感器"
          },
          {
            "id": "1-39-010",
            "name": "开关"
          },
          {
            "id": "1-39-011",
            "name": "控制器/箱"
          },
          {
            "id": "1-39-012",
            "name": "连接器"
          }
        ]
      },
      {
        "id": "1-40",
        "name": "生活日用",
        "children": [
          {
            "id": "1-40-001",
            "name": "净化除味"
          }
        ]
      },
      {
        "id": "1-41",
        "name": "收纳用品",
        "children": [
          {
            "id": "1-41-001",
            "name": "收纳袋/包"
          },
          {
            "id": "1-41-002",
            "name": "收纳箱"
          }
        ]
      },
      {
        "id": "1-42",
        "name": "家具",
        "children": [
          {
            "id": "1-42-001",
            "name": "会议台/桌"
          },
          {
            "id": "1-42-002",
            "name": "展示架"
          },
          {
            "id": "1-42-003",
            "name": "文件柜/办公柜"
          },
          {
            "id": "1-42-004",
            "name": "椅"
          }
        ]
      },
      {
        "id": "1-43",
        "name": "厨房卫浴",
        "children": [
          {
            "id": "1-43-001",
            "name": "厨卫配件"
          }
        ]
      },
      {
        "id": "1-44",
        "name": "照明",
        "children": [
          {
            "id": "1-44-001",
            "name": "室内照明"
          },
          {
            "id": "1-44-002",
            "name": "室外照明"
          },
          {
            "id": "1-44-003",
            "name": "应急照明"
          },
          {
            "id": "1-44-004",
            "name": "照明配件"
          }
        ]
      },
      {
        "id": "1-45",
        "name": "电工电料",
        "children": [
          {
            "id": "1-45-001",
            "name": "电料配件"
          },
          {
            "id": "1-45-002",
            "name": "光伏设备"
          },
          {
            "id": "1-45-003",
            "name": "开关插座"
          },
          {
            "id": "1-45-004",
            "name": "配电箱"
          },
          {
            "id": "1-45-005",
            "name": "智能家居"
          }
        ]
      },
      {
        "id": "1-46",
        "name": "基建材料",
        "children": [
          {
            "id": "1-46-001",
            "name": "补墙膏"
          },
          {
            "id": "1-46-002",
            "name": "防水卷材"
          },
          {
            "id": "1-46-003",
            "name": "防水涂料"
          },
          {
            "id": "1-46-004",
            "name": "管材管件"
          },
          {
            "id": "1-46-005",
            "name": "化工产品"
          },
          {
            "id": "1-46-006",
            "name": "基建辅料"
          },
          {
            "id": "1-46-007",
            "name": "金属漆"
          },
          {
            "id": "1-46-008",
            "name": "木材/板材"
          },
          {
            "id": "1-46-009",
            "name": "沙/石/水泥"
          },
          {
            "id": "1-46-010",
            "name": "涂刷化工类辅料"
          },
          {
            "id": "1-46-011",
            "name": "油漆/涂料"
          }
        ]
      },
      {
        "id": "1-47",
        "name": "基建辅助设施",
        "children": [
          {
            "id": "1-47-001",
            "name": "安全爬梯"
          }
        ]
      },
      {
        "id": "1-48",
        "name": "锁具",
        "children": [
          {
            "id": "1-48-001",
            "name": "机械锁"
          },
          {
            "id": "1-48-002",
            "name": "锁具配件"
          }
        ]
      },
      {
        "id": "1-49",
        "name": "农膜遮网/大棚",
        "children": [
          {
            "id": "1-49-001",
            "name": "防虫网/遮阳网"
          },
          {
            "id": "1-49-002",
            "name": "农用篷布"
          }
        ]
      },
      {
        "id": "1-50",
        "name": "园艺用品",
        "children": [
          {
            "id": "1-50-001",
            "name": "园艺辅材"
          }
        ]
      },
      {
        "id": "1-51",
        "name": "工业服务",
        "children": [
          {
            "id": "1-51-001",
            "name": "安装"
          },
          {
            "id": "1-51-002",
            "name": "维保/调试"
          },
          {
            "id": "1-51-003",
            "name": "计量/校准"
          },
          {
            "id": "1-51-004",
            "name": "送样/降本方案"
          },
          {
            "id": "1-51-005",
            "name": "租赁"
          },
          {
            "id": "1-51-006",
            "name": "闲置物资"
          }
        ]
      }
    ]
  }
];
